In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.shape

(50, 5)

# Feature Transformation

# Normalization / Min Max Scaler

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
m = MinMaxScaler(feature_range=(5,10))

In [6]:
marketing_spend_fit = m.fit(df[['Marketing Spend']]) #fit means training

In [7]:
marketing_spend_fit

MinMaxScaler(feature_range=(5, 10))

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
df['Marketing Spend'] = m.transform(df[['Marketing Spend']]) # transform means replace

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083       136897.80  471784.10    Dhaka  192261.83
1         9.916797       151377.59  443898.53      Ctg  191792.06
2         9.639923       101145.55  407934.54  Rangpur  191050.39
3         9.365682       118671.85  383199.62    Dhaka  182901.99
4         9.297189        91391.77  366168.42  Rangpur  166187.94

In [11]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083       136897.80  471784.10    Dhaka  192261.83
1         9.916797       151377.59  443898.53      Ctg  191792.06
2         9.639923       101145.55  407934.54  Rangpur  191050.39
3         9.365682       118671.85  383199.62    Dhaka  182901.99
4         9.297189        91391.77  366168.42  Rangpur  166187.94

In [16]:
df['Administration'] = m.fit_transform(df[['Administration']]) #fit means training ;  transform means replace

In [17]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083        8.258720  471784.10    Dhaka  192261.83
1         9.916797        8.809859  443898.53      Ctg  191792.06
2         9.639923        6.897895  407934.54  Rangpur  191050.39
3         9.365682        7.564992  383199.62    Dhaka  182901.99
4         9.297189        6.526640  366168.42  Rangpur  166187.94

In [18]:
df['Administration']

0      8.258720
1      8.809859
2      6.897895
3      7.564992
4      6.526640
5      6.847239
6      8.650806
7      8.587286
8      8.708664
9      7.184644
10     7.257532
11     6.541821
12     7.894178
13     8.205328
14     9.006636
15     7.715149
16     7.676352
17     8.570064
18     7.393860
19     8.891180
20     7.382118
21     8.901051
22     7.721464
23     7.073191
24     6.826938
25     8.359790
26     8.534224
27     7.914890
28    10.000000
29     8.872832
30     7.449640
31     8.860266
32     7.966468
33     6.970668
34     9.050275
35     6.285158
36     7.884123
37     5.000000
38     5.558181
39     6.206546
40     7.560204
41     6.272344
42     6.709259
43     7.896535
44     8.940358
45     7.773620
46     7.456299
47     8.202734
48     5.017509
49     7.500740
Name: Administration, dtype: float64

# Standardization

In [19]:
from sklearn.preprocessing import StandardScaler

In [ ]:
#create object for StandardScaler

In [ ]:
#traning and replcae
#all columns

# Max Absulate Scaler

In [ ]:
#find absulate value for perticular column and store in a varibale -> .abs()


#find max value for this varibale -> .max()

In [22]:
#df['Administration'] / 2

0     4.129360
1     4.404929
2     3.448947
3     3.782496
4     3.263320
5     3.423620
6     4.325403
7     4.293643
8     4.354332
9     3.592322
10    3.628766
11    3.270911
12    3.947089
13    4.102664
14    4.503318
15    3.857574
16    3.838176
17    4.285032
18    3.696930
19    4.445590
20    3.691059
21    4.450525
22    3.860732
23    3.536596
24    3.413469
25    4.179895
26    4.267112
27    3.957445
28    5.000000
29    4.436416
30    3.724820
31    4.430133
32    3.983234
33    3.485334
34    4.525137
35    3.142579
36    3.942061
37    2.500000
38    2.779090
39    3.103273
40    3.780102
41    3.136172
42    3.354630
43    3.948267
44    4.470179
45    3.886810
46    3.728149
47    4.101367
48    2.508755
49    3.750370
Name: Administration, dtype: float64

# Robust

In [ ]:
from sklearn.preprocessing import RobustScaler